Q1: How do I read a tabular data file into pandas?
 - tabular data is data in table format.

In [3]:
import pandas as pd

Here read.table assumes that the data is tab separated and first row is the headers.

In [7]:
orders = pd.read_table('https://bit.ly/chiporders')

In order to read only the first 5 rows you can use head

In [8]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [15]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('https://bit.ly/movieusers', sep='|', header=None, names=user_cols)

In [16]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213